Revit 2024 API
FabricationPart.SetCalculatedDimensionValue Method
 Sets the calculated dimension value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetCalculatedDimensionValue(
	FabricationDimensionDefinition dim,
	string value
)
Visual Basic
Public Sub SetCalculatedDimensionValue ( _
	dim As FabricationDimensionDefinition, _
	value As String _
)
Visual C++
public:
void SetCalculatedDimensionValue(
	FabricationDimensionDefinition^ dim,
	String^ value
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrication dimension.
value
Type: System.String
 The calculated dimension value.
Remarks
 Multiple dimensions may need to be set in order to reach the desired outcome. The document must be regenerated before the fabrication part can be used. Check ValidationStatus after regeneration to see if the part is valid for fabrication.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  value is not a valid calculated fabrication dimension value. -or- fabrication dimension is unable to be modified because it is locked or from a product list. -or- the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object. -or- the fabrication dimension cannot be set to the option: value.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace